Repository: NRCan/GSC-Bedrock-Data-Model-and-Tools
Catalog: ProjectEditor/DockableWindows/Dockablewindow_CreateEdit_QualityControl.*.resx
Languages: fr

# radioBtn_valContactAge.Text
source: Validate contact vs geological age
fr: Validation: Contact vs Âge Géologique

# radioBtn_valFault.Text
source: Validate fault movement
fr: Validation: Mouvement de faille

# label_GeomAnalyzeBedrock.Text
source: Analyze Geometry:
fr: Géométrie - Analyse

# radioBtn_valFlow.Text
source: Validate regional flow direction
fr: Validation: Direction régionale de flux

# label_GeomAnalyzeSurficial.Text
source: Analyze Geometry:
fr: Géométrie - Analyse

# label1.Text
source: (Case: No second unit)
fr: (Cas: Aucune unité secondaire)

# label_AttributesCorrectionSurficial.Text
source: Attribute Correction:
fr: Attributs - Correction

# radioBtn_valDrumlin.Text
source: Validate drumlin location
fr: Validation: Localisation de Drumlin

# radioBtn_nullGeolLabels.Text
source: Apply NULL values in GEO_LABELS
fr: Appliquer 'NULL' dans GEO_LABELS

# btn_ExecuteQC.Text
source: Execute
fr: Démarrer

# tabPageGeneral.Text
source: General
fr: Général

# radioBtn_valConcealineOverprints.Text
source: Find concealed line beneath selected feature layer
fr: Recherche des lignes cachées sous une couche sélectionnée

# radioBtn_reportMetadata.Text
source: Report on incomplete metadata
fr: Rapport: Métadonnées incomplètes

# radioBtn_reportPhoto.Text
source: Report missing photos
fr: Rapport: Photos manquantes

# radioBtn_reportSMS.Text
source: Report missing registered samples in SMS
fr: Rapport: Échantillons non enregistrés sous SMS

# radioBtn_findOrphanLabel.Text
source: Find map units without labels
fr: Recherche d'unité cartographique sans annotations

# radioBtn_reportGenStat.Text
source: Report general statistic on numerical data
fr: Rapport: Statistique générale sur les données numériques

# radioBtn_valGeom.Text
source: Validate XY data vs geometry (Field Station)
fr: Validation: Donnée tabulaire XY vs Géométrie (Station terrain)

# radioBtn_valBound.Text
source: Validate 'Is Boundary' (Geoline)
fr: Validation: 'Is Boundary' sous GEO_LINES

# radioBtn_valConfidence.Text
source: Validate 'Confidence' (Geoline)
fr: Validation: 'Confidence' sous GEO_LINES

# radioBtn_null.Text
source: Apply NULL values for empty attributes
fr: Changer les valeurs d'attribut vide pour 'NULL'

# radioBtn_findDiffLabel.Text
source: Find polygons with different labels
fr: Recherche de polygones contenant différentes annotations

# radioBtn_findSamePoly.Text
source: Find adjacent polygons with the same labels
fr: Recherche de polygones adjacents de même annotations

# radioBtn_findSmall.Text
source: Find features too small to display (at target scale)
fr: Recherche de petites entités (lié à l'échelle)

# radioBtn_findOutSpatialDomain.Text
source: Find features outside spatial domain
fr: Recherche d'entitée hors du domaine spatiale

# label_GeomConform.Text
source: Display
fr: Géométrie - Conformité

# label_AttributesCompleteness.Text
source: Attributes:
fr: Attributs - Complitude

# label_AttributesVal.Text
source: Validation
fr: Attributs - Validation

# label_AttributesCorrection.Text
source: Correction
fr: Attributs - Correction

# label_GeomTopo.Text
source: Geometry:
fr: Géométrie - Topologie

# tabPage_Bedrock.Text
source: Bedrock
fr: Roches en Place

# tabPage_Surficial.Text
source: Surficial
fr: Dépôts de Surface

# tabPage1.Text
source: Marine
fr: Marin
