Repository: NRCan/GSC-Bedrock-Data-Model-and-Tools
Catalog: ProjectEditor/Forms/Form_Load_SourceInformation.*.resx
Languages: fr

# label_SourceExtended.Text
source: Full Citation (Source Description)
fr: Citation complète (Description)

# label_SourceRemarks.Text
source: Remarks
fr: Remarques

# label_SourceDOI.Text
source: Digital Object Identifier (DOI)
fr: Identifiant d'Object Numérique (DOI)

# label_SourceName.Text
source: Alias (e.g. OF1839) *
fr: Abbréviation (ex: DP1839) *

# label_SourceLabel.Text
source: Name (e.g. Open File 1839) *
fr: Nom (ex: Dossier Public 1839) *

# groupBox_Project.Text
source: Source Information
fr: Information de la source

# label_SourcePath.Text
source: Source Path
fr: Chemin vers la donnée source

# btn_AddSource.Text
source: Ok
fr: Ajouter/Modifier

# btn_ClearSourceBoxes.Text
source: Clear
fr: Effacer

# label_SelectSource.Text
source: Select a Source
fr: Choisir une source
