Repository: NRCan/GSC-Bedrock-Data-Model-and-Tools
Catalog: ProjectEditor/Forms/Form_ProjectMetadata_Roles.*.resx
Languages: fr

# btn_ClearBoxes.Text
source: Clear
fr: Effacer

# label_PartActivityProject.Text
source: Select a Sub Activity *
fr: Projet associé à l'activité sélectionnée

# label_SelectPartActivity.Text
source: Select a Main Activity *
fr: Choisir une activité *

# label_PartPersonOrg.Text
source: Organization (Selected Participant)
fr: Organisation (de la personne sélectionnée)

# grp_NewParticipant.Text
source: Participant Context
fr: Contexte

# label_PartEndDate.Text
source: Select an End Date
fr: Date de fin

# btn_AddParticipant.Text
source: Ok
fr: Ajouter/Modifier

# label_PartMetaID.Text
source: Metadata ID (From Ganfeld)
fr: ID de métadonnée (pour Ganfeld)

# label_PartRemark.Text
source: Remarks
fr: Remarques

# label_PartGeolcode.Text
source: Geolcode (Mandatory for Field Data Collection)
fr: Geolcode (Obligatoire pour les données de terrains)

# label_PartRoleDesc.Text
source: Role Description
fr: Description du rôle

# label_PartRole.Text
source: Select a Role *
fr: Choisir un rôle *

# label_PartStartDate.Text
source: Select a Start Date
fr: Date de début

# groupBox_ParticipantInformation.Text
source: Participant Information
fr: Information du participant

# label_SelectParticipant.Text
source: Select a Participant
fr: Choisir un participant
