Repository: NRCan/GSC-Bedrock-Data-Model-and-Tools
Catalog: ProjectEditor/Forms/Form_ProjectMetadata_Activities.*.resx
Languages: fr

# checkBox_CGM.Text
source: CGM Map
fr: Carte CGM

# label_SelectAct.Text
source: Select a
fr: Choisir

# radioButton_MainAct.Text
source: Main Activity
fr: Principale

# groupBox_ActicvityType.Text
source: Activity Type
fr: Type d'activité

# radioButton_SubAct.Text
source: Sub Activity
fr: Sous-activité

# btn_AddAct.Text
source: Ok
fr: Ajouter/Modifier

# label1.Text
source: If sub-activity is a CGM Map
fr: Si la sous-activité est une carte CGM.

# groupBox_Act.Text
source: Activity Information
fr: Information d'activité

# label_ActEnd.Text
source: End Date
fr: Date de fin

# label_ActStart.Text
source: Start Date *
fr: Date de début *

# label_ActAbbr.Text
source: Alias
fr: Abbréviation *

# label_ActName.Text
source: Name *
fr: Nom *

# label_ActRelation.Text
source: Select a Related
fr: Relié à un/une

# btn_ClearActBoxes.Text
source: Clear
fr: Nettoyer
