Repository: NRCan/GSC-Bedrock-Data-Model-and-Tools
Catalog: ProjectEditor/Properties/Resources.*.resx
Languages: fr

# Error_SymbolMistmatch
source: Selected layer contains missing symbols. Still, they will be added to the new layer, but won't have a proper style and legend description.
fr: La couche sélectionnée contient des symboles qui n'ont pas été ajouté dans sa symbologie. Notez que l'entité sera ajouté à la nouvelle couche, mais ne sera pas correctement symbolisé et étiquetté.

# Error_SymbolMistmatch2
source: Selected layer contains missing symbols. Please refer to symbology to know the problematic codes and edit them. Use a join or a relation with another table or edit symbol with tool "Legend Items".
fr: La couche sélectionné possède des symboles manquants. Veuillez vous référer à la symbologie de cette dernière afin de connaître les codes problématiques. L'utilisation d'une jointure, d'une relation ou de l'outil "Legend Items" peut vous aider à corriger le problème.

# Error_SymbolMistmatchMessageboxTitle
source: Missing Symbol
fr: Symbol manquant

# Error_ValidNumber1
source: Entered value must be a valid number
fr: La valeur entrée doit être un nombre valide.

# GroupLayerBedrock
source: BEDROCK
fr: ROCHE EN PLACE

# GroupLayerEarthMaterials
source: EARTH MATERIALS
fr: MATÉRIAUX

# GroupLayerFieldWork
source: FIELDWORK
fr: TERRAIN

# GroupLayerInterpretation
source: INTERPRETATION
fr: INTERPRÉTATION

# GroupLayerProject
source: PROJECT
fr: PROJET

# GroupLayerSamples
source: SAMPLES
fr: ÉCHANTILLONS

# GroupLayerSurficial
source: SURFICIAL
fr: DÉPÔTS SUPERFICIELS

# GroupLayerVisualization
source: VISUALIZATION
fr: VISUALISATION

# Message_FeaturePromptTitle
source: Select a feature
fr: Sélectionner une entité géographique

# Message_FolderPrompt2
source: Select Tools4Project folder.
fr: Choisissez un dossier contenant "Tools4Project".

# Message_FolderPromptButton2
source: Tool4Project folder path
fr: Présent chemin vers le dossier Tools4Project

# Message_SpatialRefPromptTitle
source: Select a Projection
fr: Sélectionnez une Projection

# Message_ToolEnds1
source: Process completed.
fr: Procédure terminée.

# Message_ToolEnds11
source: Process completed.
fr: Procédure terminée.

# Message_ToolEndsTitle1
source: Tool
fr: Outil

# Message_ToolEndsTitle11
source: Tool
fr: Outil

# Message_XMLFilePrompt
source: Select XML file
fr: Sélectionner un fichier XML

# Text_ButtonInfo_011
source: All validations steps will: \n -Create layers in TOC of the current MXD under Validation's layer group or \n -Create a report folder in folder ..\\ProjectFolder\\Report or \n -Make the correction.
fr: Étapes de validation: \n -Création de couches qui seront ajoutées dans le présent projet MXD sous le groupe de couche nommé 'Validation' ou \n -Création d'un dossier de rapport sous ..\\ProjectFolder\\Report ou \n -Faire la correction automatiquement

# Text_PartipantRemarks1
source: Remarks
fr: Remarques

# Text_RoleDescription1
source: Enter a Role Description
fr: Écrire la description du Rôle

# Warning_BasicTitle
source: Warning
fr: Attention!

# Warning_EnvDBChanged1
source: The current version of Working_Environment.gdb was deprecated, a new version was added. You'll need to go to customize in order to re-initialize your settings.
fr: L'actuelle version de la base de donnée d'environment (Working_Environnment.gdb) était désuette et donc une nouvelle version a été ajoutés. Malheureusement, les paramètres d'environments devront être refait.

# Warning_ExistingFile
source: A copy with the same name already existed, it has been renamed with current date, and new file has been copied.
fr: Un fichier portant le même existe déjà, ce dernier a été renommé avec la date actuelle et le nouveau fichier a été copié.

# Warning_FStrucValidationErrorFound
source: Some errors from Ganfeld data has been found. For more details, a text file is available here:
fr: Des erreurs ont été trouvées dans les données en entrées. Pour plus de détails, un fichier texte est disponible ici:

# Warning_FStrucValidationErrorFoundTitle
source: Validation errors
fr: Erreur de validation

# Warning_NotImplemented1
source: Not yet implemented...
fr: En développement...

# Warning_QC_NoSameAdjLabel1
source: No neighbouring Map Units with same label value found.
fr: Aucune unité cartographique de même annotation n'a été détecté.

# Warning_QC_OrphanMU1
source: No lonely Map Unit found.
fr: Aucune unité cartographique orpheline n'a été détecté.

# Warning_StopEdit1
source: All changes were saved.
fr: Tous les changements ont été sauvegardés

# Word_English
source: English
fr: Anglais

# Word_French
source: French
fr: Français

# Form_Legend_CreateDataBundleCompleted
source: Outputs can be found here:
fr: Les résultats sont accessibles ici:

# Error_QC_ConcealedLinesEmptySelectedLayer
source: Selected layer is empty, please select a valid feature layer in table of content.
fr: La couche sélectionnée est vide, veuillez sélectionner une couche conforme dans la table des matières.

# Error_QC_ConcealedLinesNoSelectedLayer
source: Please select a valid feature layer in table of content. Selected layer must be of polygon type.
fr: Veuillez sélectionner une couche conforme dans la table des matières. La couche doit avoir une géométrie de type polygonale.

# Warning_QC_ConcealedLinesEmptyTouchLayer
source: No concealed Geolines that touches boundaries of selected feature layer were found.
fr: Aucune Geoline recoupant les frontières de la couche sélectionnée n'a été détecté.

# Warning_QC_ConcealedLinesEmptyWithinLayer
source: No concealed Geolines that falls completely inside the boundaries of selected feature layer were found.
fr: Aucune Geoline contenu intégralement sous la couche sélectionnée n'a été détecté.

# Warning_LegendExport_MissingTable
source: Selected map does not have a legend table view associated to it. Please create one with tool Create Temporary Table for Legend Generator.
fr: La carte sélectionnée n'a pas de table propre dans la base de données. Veuillez en créer une à l'aide de l'outil 'Create Temporary Table for Legend Generator'.

# Warning_LegendImport_MissingLegendTable
source: Please select a valid legend table name before continuing.
fr: Veuillez sélectionner un nom de table de légende valide, dans laquelle sera transféré les données, avant de continuer.

# Error_MissingKeyFields
source: Couldn't find one or more key fields in input table:
fr: Un ou plusieurs champs semblent manquant de la table d'attribut en entrée:
