Repository: NRCan/GSC-Bedrock-Data-Model-and-Tools
Catalog: ProjectEditor/Properties/Resources.*.resx
Languages: fr

# Error_AccessDB
source: Project database can't be access, please make sure it's available or exists.
fr: La base de données de projet est inaccessible, veuillez recommencer.

# Error_AddGeoline
source: A value must be selected in all the lists.
fr: Une valeur doit être sélectionnée dans la liste.

# Error_GSC_MissingSymbol
source: MISSING SYMBOL
fr: SYMBOLE MANQUANT

# Error_GSC_NoFeaturePlabel
source: GSC ERROR: Missing feature P_LABELS in database.
fr: ERREUR GSC: Aucune entitée P_LABELS présente dans la base de données

# Error_GSC_NoGeoline
source: GSC ERROR: Missing feature GEO_LINES in database.
fr: ERREUR GSC: Aucune entitée GEO_LINES présente dans la base de données

# Error_InvalideGeolineType
source: Invalid geoline type.
fr: Valeur invalide: type de geoline

# Error_InvalidGeolineID
source: Invalid GEOLINEID value.
fr: Valeur invalide: GEOLINEID

# Error_MapUnit
source: You must enter value for name and abbreviation of new map unit or a valid value for symbol.
fr: Veuillez entrer un nom et une abréviation pour l'unité cartographique ou une valeur pour le symbole.

# Error_Organisation
source: No valid organisation is attached to selected Person.
fr: Aucune Organisation valide n'est rattachée à la personne sélectionnée

# Error_StartEdit
source: Already in an edit session, close and restart.
fr: Une session d'édition est déjà active.

# Error_StartEditFeature
source: Project features are not available in Arc Map.
fr: Aucune entitée d'un projet en cours n'est présent dans Arc Map.

# Error_StopEdit
source: Edit session was already closed.
fr: La session d'édition est déjà fermé.

# Error_ValidNumber
source: Entered value must be a valid number
fr: La valeur entrée doit être un nombre valide.

# Message_FolderPrompt
source: Please select path to folder Tools4Project
fr: Choisissez un dossier contenant "Tools4Project".

# Message_FolderPromptButton
source: Modify current path?
fr: Modifier le présent chemin?

# Message_FolderPromptTitle
source: Current path to Tools4Project folder:
fr: Chemin vers le dossier 'Tools4Project':

# Text_ButtonInfo_01
source: Validation results could be either: \n -A query layer added to VALIDATION group layer in the Table of Content or \n -Create a report in project workspace folder ..\\ProjectFolder\\Report or \n -Make the correction needed directly to the data.
fr: Étapes de validation: \n -Création de couches qui seront ajoutées dans le présent projet MXD sous le groupe de couche nommé 'Validation' ou \n -Création d'un dossier de rapport sous ..\\ProjectFolder\\Report ou \n -Faire la correction automatiquement

# Text_PartipantRemarks
source: Remarks
fr: Remarques

# Text_RoleDescription
source: Enter a Role Description
fr: Écrire la description du Rôle

# Warning_NotImplemented
source: Not yet implemented...
fr: En développement...

# Warning_QC_NoSameAdjLabel
source: No neighbouring Map Units with same label value found.
fr: Aucune unité cartographique de même annotation voisin n'a été détecté.

# Warning_QC_OrphanMU
source: No lonely Map Unit found.
fr: Aucune unité cartographique orpheline n'a été détecté.

# Warning_StopEdit
source: All changes were saved.
fr: Tous les changements ont été sauvegardés

# Error_InvalidGeolineIDQuery
source: Selected values for Geoline feature, does not exist within SYMBOL_GEOLINES table.
fr: Les valeurs sélectionnées pour la construction de Geoline, ne sont pas disponibles dans la table SYMBOL_GEOLINES.

# Warning_QC_NoDiffLabel
source: All labels are unique within all map units.
fr: L'unicité des libellés à l'intérieur des unités cartographiques est valide.

# Warning_QC_NoLabel
source: All map units contains at least one label.
fr: Chaques unités cartographiques possèdent au moins un libellé.

# Warning_QC_NoIsBoundNo
source: No Geoline with field value "IsBoundary" = No was found.
fr: Aucune ligne GEOLINE ne possède de valeur "No" sous le champs "IsBoundary"

# Warning_QC_NoIsBoundYes
source: No Geoline with field value "IsBoundary" = Yes was found.
fr: Aucune ligne GEOLINE ne possède de valeur "Yes" sous le champs "IsBoundary"

# Warning_QC_NoStations
source: No stations were found within field station feature.
fr: Aucune stations n'est présentent dans la couche de stations terrains.

# Warning_QC_NoStationXYMismatch
source: No mismatch found.
fr: Aucune différences n'a été détectée.

# Message_AddNewHeader
source: Add New Header with option of Legend Order within Legend Display tab.
fr: Ajouter un nouveau Titre à l'aide de l'option d'ordre de légende sous l'onglet "Affichage de Légende".

# Warning_NoCGM
source: No CGM maps available within feature.
fr: Aucune carte CGM n'est présente dans la base de données.

# Error_CGM
source: You must enter value for name and id of current selected CGM map.
fr: Veuillez enter un nom et un identifiant pour la carte CGM sélectionnée.

# Message_AddNewDescription
source: Add New Description
fr: Ajouter une nouvelle description

# EmptyFields
source: Please fill in all fields with an asterix.
fr: Veuillez remplir chacun des champs suivit d'un astérix.

# Error_NoSpecificGeolines
source: No defined depositional-unconformable contact detected within geoline feature.
fr: Aucun "defined depositional-unconformable contact" n'a été détecté dans l'entité "Geoline".

# Warning_QC_GenericNoProblem
source: No problem was detected.
fr: Aucun problème n'a été identifié

# Error_MissingFeature
source: Missing feature from Arc Map project:
fr: Couche géographique manquante dans le projet Arc Map:

# Error_NoSelection
source: No layer was selected in Table of Content, please select one for the tool to work.
fr: Aucune couche n'as été sélectionné dans la table des matières. Veuillez sélectionner une couche afin de faire fonctionner l'outil.

# Error_NoSubtypes
source: There is no subtypes within selected layer.
fr: Il n'y a aucun subtypes dans la couche sélectionnée.

# Message_SaveEdit
source: All edits were saved.
fr: Toutes les éditions ont été sauvegardés.

# Warning_GanfeldNoStations
source: No station were selected.
fr: Aucune station n'est sélectionnée.

# Warning_GanfeldTooManyStations
source: Please select only one station.
fr: Veuillez sélectionner qu'une seule station.

# Message_StopEdit
source: Do you wish to save all changes?
fr: Souhaitez-vous sauvegarder les changements?

# Message_StopEditTitle
source: Stop Editing
fr: Arrêter l'édition

# Error_InvalidGeopointIDQuery
source: Selected values for Geopoint feature, does not exist within SYMBOL_GEOPOINTS table.
fr: Les valeurs sélectionnées pour la construction de Geopoint, ne sont pas disponibles dans la table SYMBOL_GEOPOINT.

# Warning_RemoveItemFromProject
source: Deleting a legend item from a project cannot be undone. Are you sure you want to delete this item?
fr: Soyez avertis, supprimer un élément de légende du projet en cours est définitif. Souhaitez-vous continuer?

# Warning_RemoveItemFromProjectTitle
source: DELETE SELECTED LEGEND ITEM?
fr: Supprimer l'élément de légende sélectionné?

# Error_LegendItemExists
source: The selected legend item exists within a feature class and cannot be deleted.
fr: L'outil a découvert que l'élément de légende était présent dans sa propre source. L'outil ne peut supprimer un élément de légende relié au projet si une entité existe physiquement dans ce projet.

# Error_LegendItemExistsTitle
source: SELECTED LEGEND ITEM EXISTS
fr: Élément de légende existant!

# Warning_NoOverprintFound
source: No overprint were found inside the project, thus no overprint layer will be created.
fr: Aucune unités de type "sur-imprimé" n'a été détecté dans le projet en cours. Aucune nouvelle couche ne sera donc ajoutée dans Arc Map.

# Warning_MultiFGDCFoundTitle
source: Multiple Symbol Code
fr: Code de Symbole Multiple

# Warning_MultipleFGDCFound
source: More then one symbol code were found in feature, only first one will be used in project legend.
fr: Plus d'un code de symbole ont été trouvé dans la couche, seulement le premier sera utilisé dans la légende de projet:

# Error_SymbolMistmatchWithStyle
source: A symbol wasn't found in the GSC style. Verify the value is written correctly. Following is the missing symbol value and it's associated item ID:
fr: Un symbole n'a pas été trouvé dans un style. Veuillez vérifier si ce dernier est bien orthographié. Ceci est le code de symbole manquant ainsi que l'identifiant d'élément de légende associé au symbole:

# ToolTip_LegendOrderListBox
source: Item Color Code: {0}Orange: Map Units{0}Blue: Geolines{0}Green: Geopoints{0}White: Headers{0}Pink: Others
fr: Code de couleur des éléments:{0}Orange: Unités Cartographiques{0}Bleu: Geolignes{0}Vert: Geopoints{0}Blanc: Titres{0}Rose: Autres

# Message_EventNameAdd
source: Name
fr: Nom

# Message_EventNameAddTitle
source: New Geological Event Name
fr: Nouveau nom d'événement géologique

# Error_NoSelectionFeature
source: No feature were selected on the map, please do and restart current tool.
fr: Aucun élément n'est présentement sélectionné dans la carte. Veuillez recommencer.

# Message_AgeItemMessage
source: Select wanted items.
fr: Sélectionner les éléments souhaités.

# Message_AgeItemTitle
source: Map Units and Geolines from Legend
fr: Unités cartographique et géolignes

# Message_AddTheme
source: New Type
fr: Nouvel élément

# Message_AddThemeTitle
source: Add New Item Type
fr: Nouveau type d'élément de légende

# WarningQuestion_WrongProject
source: Current ArcMap layers are not related to an active project geodatabase. Would you like to set them as active?
fr: Les données actuelles ne proviennent pas d'un projet actif. Aimeriez-vous qu'elle le deviennent?

# Error_TooManyCharacters
source: Too many characters were entered. Limit:
fr: L'entrée comporte trop de caractères. Limite:

# Warning_MissingFonts
source: Detected some missing fonts, please installed proper project fonts.
fr: Certaines polices n'ont pas été détectés. Veuillez-vous assurer d'avoir bien installer l'ensemble des polices du projet.

# Message_SelectCartoElement
source: Select CartoElement database
fr: Sélectionner la base de donnée CartoElement.gdb

# Dialog_DescriptionGanfeldDB
source: Select a database containing Ganfeld data.
fr: Sélectionner une base de données de type Ganfeld.

# Dialog_DescriptionProjectFolder
source: Enter a new project folder name.
fr: Entrer un nouveau nom de dossier de travail de projet.

# Dialog_DescriptionSource
source: Select desire source file.
fr: Sélectionner un fichier source.

# Dialog_NewParticipantLabel
source: Choose one
fr: Choisir une seule personne

# Dialog_NewParticipantTitle
source: Select a Person
fr: Sélectionner une personne

# Dialog_SelectGanfeldShapefileFolder
source: Select a folder containing Ganfeld Shapefiles.
fr: Sélectionner un dossier contenant des Shapefiles issue de Ganfeld

# Dialog_SelectLUTFolder
source: Select a folder containing Ganfeld LUT files.
fr: Sélectionner un dossier contenant les fichiers de table LUT.

# EmptyFields1
source: Please fill in all fields with an asterix.
fr: Veuillez remplir chacun des champs suivit d'un astérix.

# Error_CopyStyleFailed
source: Entered style can't be copied because a file with the same name already exists in style folder.
fr: Le fichier de style sélectionné ne peut être copier puisqu'un fichier portant le même nom existe dans le dossier de style.

# Error_CopyTitle
source: Can't copy
fr: Impossible de Copier

# Error_GenericTitle
source: Error found
fr: Une erreur a été détectée

# Error_InvalidCoord
source: Invalid coordinate entry.
fr: Une valeur de coordonnée en entré est invalide.

# Error_MissingStructureIDFields
source: Can't find EARTHMATID or STATIONID fields. Make sure input data respects field data schema and has field names exaclty like an original field dataset.
fr: Impossible de trouver EARTHMATID ou STATIONID. Veuillez vous assurez que la données en entré soit une donnée terrain valide ayant les mêmes champs qu'une donnée originale.

# Error_MissingTable
source: A table is missing inside project database.
fr: Une table est absente de la base de données.

# Error_Name25Lenght
source: Entered value for Name exceeds the maximum of 25 characters.
fr: La longueur pour le champ "Nom" dépasse la limite maximale de 25 caractères.

# Error_NeedPolygon
source: Imported feature needs to be polygons in order to work.
fr: L'entité importée n'est pas polygonale. Veuillez réessayer.

# Error_NeedPolygonTitle
source: Wrong geometry!
fr: Géométrie inadéquate!

# Error_NotEnable
source: You must first enable workspace by clicking "Enable Interfaces" to launch properly this tool.
fr: Veuillez activer les interfaces avant de lancer cet outils.

# Error_NotEnableTitle
source: Enable interfaces
fr: Activer les interfaces

# Error_NotInScientificLanguageDictionary
source: Missing Value in Scientific Language
fr: Valeur manquante du dictionnaire de termes scientifiques.

# Error_Organisation1
source: No valid organisation is attached to selected Person.
fr: Aucune Organisation valide n'est rattachée à la personne sélectionnée

# Error_PersonIDTooLong
source: Entered alias is too long, it must be less than 8 caracters.
fr: L'alias de la personne est trop long, ce dernier doit être plus court que 8 caractères.

# Error_PurposeValue
source: No selected purpose values exists in database.
fr: Le thème sélectionné ne possède aucune valeur au sein de sa table.

# Error_RestrictiedFieldName
source: Input feature field is restricted, please rename input field:
fr: Un champ contenu dans la donnée d'entrée doit être renommé afin d'exécuter l'outil:

# Error_TopologyAlreadyExists
source: A topology layer already exists within project database.
fr: Une couche topologique existe déjà dans la base de donnée de projet.

# Error_WrongFileType
source: Enter dataset is not handle by the tool. Please select a Shapefile, File Geodatabase data, text file or Excel sheet for the load.
fr: La donnée sélectionnée n'est présentement pas supporté par l'actuelle version de l'outil. Veuillez sélection un Shapefile, une donnée à l'intérieur du File Geodatabase, d'un fichier texte ou d'une feuille Excel.

# Error_WrongGeometry
source: Entered feature needs to be point.
fr: La donnée en entrée doit être de type point.

# FindKeyWord_01
source: Add
fr: Ajouter

# Keyword_ActivDatabase
source: Active
fr: Actif

# Keyword_BuildCGM
source: Build_CGM_
fr: Carte_CGM_

# Label_Activity_RelatedToMainAct
source: Main Activity *
fr: Activité Principale *

# Label_Activity_RelatedToProject
source: Project *
fr: Projet *

# Label_Activity_SubAct
source: Sub Activity *
fr: Sous Activité

# Message_AddExistingWorkspace
source: Add Existing Workspace
fr: Ajouter un espace de travail existant

# Message_AddNewActivity
source: Add New Activity
fr: Ajouter une Nouvelle Activité

# Message_AddNewArea
source: Add New Study Area
fr: Ajouter une Nouvelle Zone d'Étude

# Message_AddNewDatabase
source: Add Existing Database
fr: Ajouter une Base de Données existante

# Message_AddNewOrganisation
source: Add New Organisation
fr: Ajouter une Nouvelle Organisation

# Message_AddNewParticipant
source: Set as New Participant
fr: Ajouter comme Nouveau Participant

# Message_AddNewPerson
source: Add New Participant
fr: Ajouter un Nouveau Participant

# Message_AddNewProject
source: Add New Project
fr: Ajouter un Nouveau Projet

# Message_AddNewsSource
source: Add New Source
fr: Ajotuer une Nouvelle Source

# Message_AddStyle
source: Add Custom Style File
fr: Ajouter un fichier de style

# Message_AddTheme1
source: Write new theme.
fr: Écrivez le nouveau thème.

# Message_AddThemeTitle1
source: New Theme
fr: Nouveau Thème

# Message_CreateMXD
source: Create MXD
fr: Création d'un document MXD.

# Message_CreateWorkspace
source: Create workspace
fr: Espace de travail

# Message_DataPromptTitle
source: Select data to load
fr: Sélectionnez la donnée à importer dans la base de données.

# Message_FolderPrompt1
source: Please select path to folder Tools4Project
fr: Choisissez un dossier contenant "Tools4Project".

# Message_FolderPromptButton1
source: Modify current path?
fr: Modifier le présent chemin?

# Message_FolderPromptTitle1
source: Do you wish to change current path to Tools4Project folder:
fr: Chemin vers le dossier 'Tools4Project':

# Message_FStruc
source: Entered structural data is missing key fields, check wheter or not input data comes from Ganfeld.
fr: La donnée entrée manque des champs clés. Veuillez vérifier que la donnée est bien issue de l'application Ganfeld.

# Message_FStrucTitle
source: Missing Key Fields
fr: Champs clés manquants

# Message_NoMainActivityInDB
source: No Activity exists in database
fr: Aucune Activité principale n'est présente dans la base de données

# Message_NoSubAct
source: No Sub Activity
fr: Aucune Sous Activité

# Message_OtherSourceTransfered
source: Some data present in the old version didn't match current Bedrock Project Database schema. They have been transfered into another database:
fr: Des données présentent dans la vieille version de la base de données ne concordaient pas avec le présent schéma. Elles ont donc été transférées dans une autre base de données, voir:

# Message_OtherSourceTransfered_Title
source: Other data sources have been found!
fr: D'autres données sources ont été détectées!

# Message_SelectOLDPGDB
source: Select geodatabase to upgrade
fr: Sélectionner l'ancienne base de donnée Projet dans laquelle l'outil ira chercher les données.

# Message_TextFileSeperatorQuestion
source: Enter current text file column seperator character.
fr: Veuillez entrer le caractères de séparation des colonnes du fichier texte en entré.

# Message_TextFileSeperatorTitle
source: Seperator Character
fr: Caractère de séparation des colonnes

# Message_ToolEnds
source: Process completed.
fr: Procédure terminée.

# Message_ToolEndsTitle
source: Tool
fr: Outil

# Warning_CartoAttribute
source: Please select a theme before loading any data.
fr: Veuillez sélectionner un thème avant de verser des données dans la base de données.

# Warning_EnvDBChanged
source: The current version of Working_Environment.gdb was deprecated, a new version was added. You'll need to go to customize in order to re-initialize your settings.
fr: L'actuelle version de la base de donnée d'environment (Working_Environnment.gdb) était désuette et donc une nouvelle version a été ajoutés. Malheureusement, les paramètres d'environments devront être refait.

# Warning_ParticipantDomainCleanUp
source: Participant Domain can't be cleaned up of old value, please refresh manually.
fr: Le domaine de Participant ne peut être nettoyé par les outils. Un nettoyage manuel doit être effectué.

# ErrorEventCreation
source: An error occured while creating the XY Event for field data. Check field data and make sure there is no unique key duplicate inside table.
fr: Une erreur est survenue lors de la création d'événement XY avec les données terrains. Vérifier qu'il n'existe pas de doublons dans les STATIONID ou que les données sont conformes.

# ErrorEventCreationTitle
source: Field Data XY Event
fr: Événement XY de données terrains

# ErrorNoExtensionTitle
source: Extension Not Available
fr: Extension non disponible

# ErrorNoMaplexInMXD
source: Maplex Label Engine extension is not available for the moment. Map document will be created without it.
fr: L'extension "Maplex Label Engine" est pour le moment non disponible. Le document de cartographie en sera donc dépourvue pour le moment.

# Error_AccessDB1
source: Project database can't be accessed. Make sure it's available or exists.
fr: La base de données de projet est inaccessible, veuillez recommencer.

# Error_AddGeoline1
source: A value must be selected in all the lists.
fr: Une valeur doit être sélectionnée dans la liste.

# Error_CantDeleteWorkspace
source: Workspace can't be deleted, check for a possible lock.
fr: Un jeu de données ne peut être supprimé, veuillez vérifier si ce dernier n'est pas en cours d'utilisation ailleurs.

# Error_DisplayField
source: GSC ERROR: A join currently exists on GEO_LINE feature, please remove it to make layer symbol appear correctly. This problem will be corrected.
fr: ERREUR GSC: Une jointure existe dans la couche GEO_LINE, veuillez enlever cette dernière afin de faire apparâitre les symboles correctement. Ce problème sera remédié prochainement.

# Error_FileOrFolderDontExists
source: Input file or folder doesn't exists or is not a valid single copyable file. The copy process didn't happen. Path:
fr: Un dossier ou un fichier n'existe pas ou n'est pas un ficher valide pouvant être copié. La procédure de copie n'a donc pas été exécuté. Voici la chemin problématique:

# Error_FileOrFolderDontExistsTitle
source: Missing parameter
fr: Paramètre manquant

# Error_GenericTitle1
source: An error was found
fr: Une erreur a été détectée

# Error_GeoprocessingFail
source: Geoprocessing Failed.
fr: Un outil de géoprocédure s'est mal terminé.

# Error_GSC_MissingSymbol1
source: GSC MISSING SYMBOL
fr: SYMBOLE DE LA GSC MANQUANT

# Error_GSC_NoFeaturePlabel1
source: GSC ERROR: Missing feature P_LABELS in database.
fr: ERREUR GSC: Aucune entitée P_LABELS présente dans la base de données

# Error_GSC_NoGeoline1
source: GSC ERROR: Missing feature GEO_LINES in database.
fr: ERREUR GSC: Aucune entitée GEO_LINES présente dans la base de données

# Error_InvalideGeolineType1
source: Invalid geoline type.
fr: Valeur invalide: type de geoline

# Error_InvalidGeolineID1
source: Invalid GEOLINEID value.
fr: Valeur invalide: GEOLINEID

# Error_InvalidGeolineIDQuery1
source: Selected values for Geoline feature, does not exist within GEOLINE_SYMBOL table.
fr: Les valeurs sélectionnées pour la construction de Geoline, ne sont pas disponibles dans la table GEOLINE_SYMBOL.

# Error_InvalidGeopointID
source: Invalid GEOPOINTID value.
fr: Valeur invalide: GEOPOINTID

# Error_MapUnit1
source: You must enter value for name and abbreviation of new map unit or a valid value for symbol.
fr: Veuillez entrer un nom et une abréviation pour l'unité cartographique ou une valeur pour le symbole.

# Error_MissingActicity
source: A given activity wasn't found inside activity table.
fr: Une activité n'as pas été trouvé dans la table activité.

# Error_NoEnvDB
source: Please run set working environment tool in Arc Catalog before launching any tools in Arc Map.
fr: Veuillez utiliser l'outil de Configuration de l'environnement sous Arc Catalog avant de pouvoir utiliser les outils d'Arc Map.

# Error_NoParticipant
source: No participant are present in the project.
fr: Aucun participant n'est disponible dans le projet en cours.

# Error_NoSelectedValue
source: Please, select a value inside a required list.
fr: Veuillez sélectionner une valeur dans une des listes requises.

# Error_NotInScientificLanguageDictionary1
source: Missing Value in Scientific Language
fr: Valeur manquante du dictionnaire de termes scientifiques.

# Error_Organisation2
source: No valid organisation is attached to selected Person.
fr: Aucune Organisation valide n'est rattachée à la personne sélectionnée

# Error_SpatialRefMismatch
source: Spatial Reference mismatch between input feature and feature to append.
fr: Problème de référence spatiale entre la donnée en entré et la donnée en sortie.

# Error_StartEdit1
source: Already in an edit session, close and restart.
fr: Une session d'édition est déjà active.

# Error_StartEditFeature1
source: There might be an existing file lock due to processing by another application/user, be sure to close ArcCatalog or notify the other user.
fr: Arc Map ne possède aucunes couches actives représentant une base de données de projet conforme. Une base de donnée en cours de lecture sur un autre poste ou dans Arc Catalog peut aussi causer ce message à s'afficher.

# Error_StopEdit1
source: Edit session was already closed.
fr: La session d'édition est déjà fermé.
